[
    {
        "id": 18024553762031572,
        "created_at": 1548026318,
        "text": "@ltseligman 🙌🙌🙌🙌 Nice to hear something about this entire shitshow of bruised male egos that finally makes sense, is extremely thorough  incredibly intelligent, point on and furthermore something to be appreciated and applauded! Love, love, loooove how you speak your truth and the truth!!!! 🙌👏😊🤗 Much love my thoughtful friend!!!💗🙏💗",
        "owner": {
            "id": "646495253",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/28a3a23c9dec1b02682f1b1f515455ec/5D29AA0B/t51.2885-19/s150x150/46895298_2095096007213374_6683527569993629696_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "witchykindawoman"
        },
        "answers": []
    },
    {
        "id": 17989986520166206,
        "created_at": 1548004790,
        "text": "In response to all the “men” who feel threatened, bruised, betrayed or any other imagined harm by the #Gillette ad, please stop and stop thinking “like a man”. The Gillette  campaign is great! \nEncouraging men to instill values that are compassionate and inclusive in boys is good. The fact that we still consider a “man’s” entitlement to have “men will be men” and “boys will be boys” belongs on the scrap-heap of misplaced arrogance of flat-Earthers, Creationism, and the moon being made of cheese. Racial.... gender... religious... or any other false delusion of superiority is simply Neanderthal thinking and while I’m sure those of you who actually think this position of defending the status quo is valid because it worked for you and your dad and his dad... are simply perpetuating the indefensible patriarchy that already positions you on the wrong side of history, but moreover, the wrong side of right and wrong. \nI encourage “real men” who understand and respect the privilege that has been handed to them in the gender lottery of time and place to recognize that the most manly thing you can do is to lift others up and open yourself to the revolutionary concept of encouraging those you don’t consider manly to contribute, mold and influence the future as for the first time in history, the future is not exclusively yours to dictate. You will be surprised by all the grand solutions, perspectives, insights, processes , etc. that your hunter brain would never have conceived of and a be fuller human being for it.",
        "owner": {
            "id": "304241042",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/9bf36e1243620f37727f23d00ea314ba/5D2BB096/t51.2885-19/s150x150/30079612_1863522557037917_1099423559471595520_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "ltseligman"
        },
        "answers": []
    }
]