[
    {
        "id": 17953778167231294,
        "created_at": 1548788462,
        "text": "Go to our website and order student work",
        "owner": {
            "id": "7984354907",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/2c7da02e9d353ef2d1a36f5cb1badc0b/5D2B2D8E/t51.2885-19/s150x150/47690476_347360652519102_4966684014837497856_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "evgeniiazelenskaia3"
        },
        "answers": []
    },
    {
        "id": 17959849819213316,
        "created_at": 1547739540,
        "text": "@ladybosproductions Very well said. On social media, I see a lot of people being mean and rude to one another, keyboard warriors.\n\nDollar Shave Club: http://shaved.by/lCI0S *Love you, stay safe and warm! 🍀",
        "owner": {
            "id": "1119798947",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/67315b368b0739d064b2cb52752733ef/5D4BA438/t51.2885-19/11850184_415914111928268_1309388140_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "shamrocksandglocks"
        },
        "answers": []
    },
    {
        "id": 17932753453250673,
        "created_at": 1547720650,
        "text": "@shamrocksandglocks I honestly don’t see toxic femininity as a widespread problem sweeping the country, however that does seem like a clear cut case of human indecency. I think we have found ourselves in a place where we no longer approach one another with kindness and it is incredibly unfortunate. I suppose my hope is that as men soften and embrace their feelings/learn to communicate those feelings and women feel less oppressed and also learn to process their feelings in a healthy way and communicate their needs better- I hope that at that point we will approach the ones we love and even strangers with more kindness, patience, tolerance, and understanding.",
        "owner": {
            "id": "6572366341",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6c67d35a378ca1365962803e8daef90e/5D31D55C/t51.2885-19/s150x150/47585320_950237362030566_8785922539651072_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "ladybosproductions"
        },
        "answers": []
    },
    {
        "id": 17849994892334910,
        "created_at": 1547689511,
        "text": "@ladybosproductions I had a guy at Gillette who would sell me razors on the cheap, but when I moved to Vegas I lost the connection. Dollar Shave Club razors last a long time, cut well, and are $1.5 per razor  delivered.\nWhat should a man do about toxic femininity?\nCase in point: Out to suppah with two other couples and one of the wives tells her husband to: “shut the fuck up!” He nervously laughs and sheepishly tries to explain and she says: “I SAID, shut the fuck up!”\nVery uncomfortable environment and I didn’t see it as my place to ask her to be nice or not so rude. \nNever went out with that couple again.",
        "owner": {
            "id": "1119798947",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/67315b368b0739d064b2cb52752733ef/5D4BA438/t51.2885-19/11850184_415914111928268_1309388140_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "shamrocksandglocks"
        },
        "answers": []
    },
    {
        "id": 17998267795184477,
        "created_at": 1547688089,
        "text": "@shamrocksandglocks I’ve heard similarly great things about Harry’s - maybe it’s time to make the switch! I’ve been shaving with Venus since I was 12.",
        "owner": {
            "id": "6572366341",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6c67d35a378ca1365962803e8daef90e/5D31D55C/t51.2885-19/s150x150/47585320_950237362030566_8785922539651072_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "ladybosproductions"
        },
        "answers": []
    },
    {
        "id": 17842751644350266,
        "created_at": 1547682187,
        "text": "Dollar Shave Club. Fantastic razors at a fraction of the cost. I’ve been a member for years.",
        "owner": {
            "id": "1119798947",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/67315b368b0739d064b2cb52752733ef/5D4BA438/t51.2885-19/11850184_415914111928268_1309388140_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "shamrocksandglocks"
        },
        "answers": []
    },
    {
        "id": 17996061223190664,
        "created_at": 1547663854,
        "text": "@ladybosproductions...that would be feedback I would think Gillette would want to know.  If you have tried there new femalecentric products and feel their male products work better I would say they are wasting money on R&D.  In any case I am finding this conversation interesting.  I have had all my employees watch the video and i am waiting on their feedback.",
        "owner": {
            "id": "3443599603",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/2fe0ec1351a947188c9c6480569f22bf/5D390DBF/t51.2885-19/s150x150/24274428_2008835849393182_562588149671264256_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "joepirelli"
        },
        "answers": []
    },
    {
        "id": 17891849533294112,
        "created_at": 1547663468,
        "text": "@wendyjehlen I think I totally agree. Even if it’s “just a marketing ploy” - marketing ploys for decades have been setting the tone for misogyny. It’s nice to see that change.",
        "owner": {
            "id": "6572366341",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6c67d35a378ca1365962803e8daef90e/5D31D55C/t51.2885-19/s150x150/47585320_950237362030566_8785922539651072_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "ladybosproductions"
        },
        "answers": []
    },
    {
        "id": 18008723083106282,
        "created_at": 1547663348,
        "text": "@joepirelli it’s just sort of funny cause I know a lot of women who specifically buy men’s razors because they are cheaper and work better, particularly on women with thicker/coarser hair",
        "owner": {
            "id": "6572366341",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6c67d35a378ca1365962803e8daef90e/5D31D55C/t51.2885-19/s150x150/47585320_950237362030566_8785922539651072_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "ladybosproductions"
        },
        "answers": []
    },
    {
        "id": 17846985871337972,
        "created_at": 1547657196,
        "text": "My take...like most things that turn politically charged there are lots of angles on this.  Gillette has been losing market share for quite a few years.  The beard is in and beard maintenance requires more priducts than just razors.  They are also losing to places like the dollar shave club and Harry's and even Schick is making refills to fit Gillette products.  From a personal perspective I wont use another razor other than Gillette Fusion but that is not the case for most people.  Gillette was pushing to be more socially responsible....big with millennials.  Thus garnering a new era of loyal customers, hopefully that qas not their only reason I think they did a great job with the ad.  The only things i have heard as far a negativity ( in my circle 40 to 50 year old men). Was the toxic masculinity phrase and that was a turn off for some and they tuned out.  I have read most of the articles you mention above.  Again my take from business standpoint Gillette may have hurt themselves in the fact that they seem to have aleniated some men...As far as the Pink Tax goes. That one upon first glance seems a little hypocritical.  But again is no so simple from just a numbers approach.  Gillette was solely a male shaving company for a long time.  It is not the case anymore.  However although it is still number 1 in mens it is not when it comes to females.  Gillette is now spending a ton of money on research into female shaving and the fact that it is a much arger area and more complex than men.  Gillette initially would repackage their \"male\" line and sell as female razors.  That is not the case any longer.  For instance the Embrace which is a 5 blade razor...like the Fusion i use is the same in only the 5 blades.  The Embrace howver has a ribbon of moisture, a rounded cartridge, a different more  complicated pivot point, a softer handle with grip points that ergonomically fit what their research showed as to how women shave.  Thus comparing price points is not necessarily apples to apples when you compare just blade number.  As far as the other products go...just a guess but I would say more thought and research has gone into those un recent history thus the higher price",
        "owner": {
            "id": "3443599603",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/2fe0ec1351a947188c9c6480569f22bf/5D390DBF/t51.2885-19/s150x150/24274428_2008835849393182_562588149671264256_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "joepirelli"
        },
        "answers": []
    },
    {
        "id": 17931712894252858,
        "created_at": 1547657030,
        "text": "I loved it. I don’t buy Gillette razors, and won’t start now. But if this is what cynical marketing looks like, we’re moving in the right direction as a society. Ads tell us what advertisers think will sell. If this sells, or even if they think it will, that tells us something. And I don’t think they made a mistake here. The men (and women) complaining are the dying breed.",
        "owner": {
            "id": "1615735492",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a19c3fdc8b922f5740e237df501a98a1/5D37009C/t51.2885-19/s150x150/17334095_1331692680231421_3510631685643304960_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "wendyjehlen"
        },
        "answers": []
    }
]