[
    {
        "id": 17992398790152207,
        "created_at": 1547760545,
        "text": "@antrealist that could be. If that’s the case then I would be willing back off a bit...even though I would say that I have never been witness to boys maliciously beating the crap out of each other and a family friendly function and men nonchalantly or approvingly standing by.  That would get shut down immediately and men should be given more credit than that. My understanding is that they were playing. Even so, the problem isn’t the excessiveness of male upbringing and the fostering of aggression. If anything the problem is closer to the massive ABSENCE of men in the home to train (not squelch...train) the inherit aggression in their sons, AND DAUGHTERS for that sake. Because it’s not like females (whom Gillette also provide products for) are innocent and don’t participate in bullying, oppressive behavior. Just sayin.",
        "owner": {
            "id": "42141960",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/898efcf6408b8bc35b50f9300a2555c6/5D4C0281/t51.2885-19/s150x150/52514276_271675900425226_5527979052935151616_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "jonasfields"
        },
        "answers": []
    },
    {
        "id": 18022560532006095,
        "created_at": 1547755030,
        "text": "@jonasfields I have to disagree that it was just kids wrestlers in the backyard. I will watch the commercial again and try to see it from your perspective. My perspective was that the child was being bullied and did not want any part of it.",
        "owner": {
            "id": "15017643",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/c45390ea05697155cf512a8762c077d5/5D4FD9D8/t51.2885-19/11203325_1108296645863520_868279900_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "antrealist"
        },
        "answers": []
    },
    {
        "id": 18022860544056208,
        "created_at": 1547753121,
        "text": "And THEN to profit from that same honed aggression, while calling it bad, is just insanely hypocritical to me.",
        "owner": {
            "id": "42141960",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/898efcf6408b8bc35b50f9300a2555c6/5D4C0281/t51.2885-19/s150x150/52514276_271675900425226_5527979052935151616_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "jonasfields"
        },
        "answers": []
    },
    {
        "id": 17949343543225531,
        "created_at": 1547753072,
        "text": "@dennero I totally hear you man. When engaging in disagreement or conflict there should be a verbal discourse to deescalate the situation. You will never hear me disagree with that. But that’s not what the AD is suggesting. The faulty assumption that is being made by Gillette is that there is a direct causation between boyhood back yard wrestling matches and the violence you see on the street and schools, the harassment you see in the workplace, and the objectification of women in media. I would disagree with that assumption. Further, The solution they painted was that if a father would stop their sons from wrestling then we are all better for it. That is assuming there is no utility to wrestling. I believe there is. I think you want these boys to meet their limits physically, emotionally, and intellectually in the safety of their own home under the observation of people who love them. To help them know that they are aggressive and flawed creatures and need to PRACTICE honing that aggression into something productive. By doing this, they will have the courage AND the ability to stand up for the bullied, to call out the inappropriate behavior in the workplace, and defend their community from objectification (including doing so against themself if need be). To assume they could, and would, do this (let alone do this effectively) by avoiding boyhood/manhood is just unwise.",
        "owner": {
            "id": "42141960",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/898efcf6408b8bc35b50f9300a2555c6/5D4C0281/t51.2885-19/s150x150/52514276_271675900425226_5527979052935151616_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "jonasfields"
        },
        "answers": []
    },
    {
        "id": 18004552336126405,
        "created_at": 1547750065,
        "text": "@jonasfields It isn’t “making them feel bad.” It’s about educating them at a young age to not give in to aggression right away. Use words to deescalate conflicts. Don’t start throwing punches the first time someone argues with you. Further, if we don’t educate boys and young men to be less aggressive when they are younger, then they may be more likely to commit acts of sexual assault on the first woman to say “no” to them.",
        "owner": {
            "id": "20214206",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6a28cd233a0cd49e29ffd860f1b7e912/5D3DA039/t51.2885-19/s150x150/20687208_1418181871569530_2308589997281771520_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "dennero"
        },
        "answers": []
    },
    {
        "id": 18008315917106977,
        "created_at": 1547748561,
        "text": "100% truth @dennero.  And I’m not saying bullying is okay or should ever be condoned. However, the problem of bullying isn’t due to boys wrestling in the back yard at a barbecue. And making boys feel bad about their aggressive nature isn’t the solution.",
        "owner": {
            "id": "42141960",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/898efcf6408b8bc35b50f9300a2555c6/5D4C0281/t51.2885-19/s150x150/52514276_271675900425226_5527979052935151616_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "jonasfields"
        },
        "answers": []
    },
    {
        "id": 18023165893033904,
        "created_at": 1547748164,
        "text": "Football players consent to getting hit. No one can consent to being bullied.",
        "owner": {
            "id": "20214206",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6a28cd233a0cd49e29ffd860f1b7e912/5D3DA039/t51.2885-19/s150x150/20687208_1418181871569530_2308589997281771520_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "dennero"
        },
        "answers": []
    }
]