[
    {
        "id": 17907527470301731,
        "created_at": 1547842621,
        "text": "@okiemfizjoterapeuty a to m.in. pokazuje spot Gillette. Tego też trzeba uczyć ludzi i właśnie nie wiem w jakiś sposób chciałabyś pokazać to bez pokazania przemocy.",
        "owner": {
            "id": "1403231628",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/8a1d91ad9fd63024eabbbcad2f55c5e7/5D2DF10E/t51.2885-19/s150x150/33029101_942594592580453_3529950779253194752_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "okiemfizjoterapeuty"
        },
        "answers": []
    },
    {
        "id": 17991775636156340,
        "created_at": 1547842574,
        "text": "@cialkiem_cudownie ale nie piszesz w poście nic o tym jak pokazać aktywne zapobieganie i stopowanie przemocy w momencie kiedy ona już się dzieje bez pokazania samej przemocy.",
        "owner": {
            "id": "1403231628",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/8a1d91ad9fd63024eabbbcad2f55c5e7/5D2DF10E/t51.2885-19/s150x150/33029101_942594592580453_3529950779253194752_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "okiemfizjoterapeuty"
        },
        "answers": []
    },
    {
        "id": 17962404622201009,
        "created_at": 1547840446,
        "text": "@pauljnna skoro tak, to okej, nie spodobało mi się tylko to sugerowanie, że „skoro myślisz tak i tak, to na pewno masz taki i taki problem”. No ale w dyskusjach internetowych trudno już jest na takim poziomie zaawansowania dobrze dyskutować, bo brakuje osobistej więzi i znajomości rozmówcy, jego historii, intencji. Gdybyśmy się lepiej znali, pewnie taki zarzut by nie padł w stronę Tomka i moją. No ale taki urok social mediów :) Badam też trochę teren pod tym względem, bo nie za bardzo mi się uśmiecha jakoś się instalować na mieliźnie. To co mnie interesuje najbardziej to historie ludzi i ich uczucia, niekoniecznie idee i wysublimowane koncepty. Chyba wyczerpałyśmy temat, dziękuję za Twoje komentarze i miłego wieczoru 🤗",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 18009775441103544,
        "created_at": 1547840120,
        "text": "@okiemfizjoterapeuty piszę o tym pokrótce w poście, co z mojego punktu widzenia byłoby lepsze niż kolejna „przemocowa” kampania.",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17892221599292455,
        "created_at": 1547839896,
        "text": "Jak byś chciała pokazać w reklamie/spocie zapobieganie przemocy etc bez pokazywania przemocy?",
        "owner": {
            "id": "1403231628",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/8a1d91ad9fd63024eabbbcad2f55c5e7/5D2DF10E/t51.2885-19/s150x150/33029101_942594592580453_3529950779253194752_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "okiemfizjoterapeuty"
        },
        "answers": []
    },
    {
        "id": 18008224243103632,
        "created_at": 1547839346,
        "text": "@cialkiem_cudownie Moje bez odbioru oznacza - dzięki za dyskusję i uciekam :-) Nie mogę spędzić tutaj tygodnia, nie rozumiem dlaczego od razu zakładasz że chciałam być niemiła? Serio, żadnych wyrażonych uczuć, nie musimy się zgadzać, na tym polega dyskusja przecież. Masz prawo do własnej interpretacji :-) Ja po prostu uważam że to wszystko się sprowadza na końcu do \"If your allyship only extends as far as your comfort, you are not an ally.\" Więc uważam że powinniśmy więcej od siebie samych wszyscy oczekiwać, i tyle :-) Więc, dziękuję za kulturalną dyskusję i uciekam zadbać o własne dobro umysłowe, bez złośliwości, serio serio 😊",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17993261653150771,
        "created_at": 1547838993,
        "text": "@pauljnna uwielbiam to „bez odbioru”... Nie czuję się wysłuchana w ogóle w takiej sytuacji i @tomekwawrzyniuk akurat nikogo tutaj do niczego nie przekonuje, tylko pisze o swoich odczuciach. A po to napisałam ten post i otworzyłam dyskusję, żeby dać trochę miejsca tym którzy mają trochę inne spojrzenie niż wszyscy których czytam.",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 18026710999057615,
        "created_at": 1547838734,
        "text": "@pauljnna każdy ma inną wrażliwość i do mnie też nie dociera przekaz, jak ktoś mnie bierze za kłaki i wciska w oczy jaskrawe stereotypy, zamiast pokazać czegoś pozytywnie. To jest właśnie retoryka telewizyjnych wiadomości, ale można to było zrobić lepiej. Chciałabym trzymać się faktu, że do większości mężczyzn, sądząc po reakcjach na tę reklamę, jednak to nie trafia i efekt jest odwrotny. Moim zdaniem samo to już świadczy o tym, że to chybiony pomysł. A co do zmian społecznych w konstruowaniu płci mam wrażenie, że chodzi nam dokładnie o to samo, tylko akurat w przypadku tej reklamy chciałam się zastanowić dlaczego to NIE DZIAŁA – bez stawiania takich ośmieszających tez jak to, że jeśli kogoś to poruszyło, to znaczy ze ma ze sobą problem 🙄 sorry ale to już jest trochę gaslighting",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17948762284240859,
        "created_at": 1547838321,
        "text": "@tomekwawrzyniuk I PS. Zalecałabym bardzo nie pisać że problemy o których mówi ta kampania to \"nieistotne szczegóły\", bo może to brzmieć jakbyś uważał że problem z przemocą, gwałtami, toksyczna męskościa etc to \"nieistotne szczegóły\", a nie wydaje mi się że to miałeś na myśli. Bez odbioru ❤️",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17855083813323956,
        "created_at": 1547838085,
        "text": "@tomekwawrzyniuk A i jeszcze - nie, nie zawsze byliśmy tymi samymi mężczyznami i kobietami. Nawet teraz nie jesteśmy, zależy na jakiej szerokości geograficznej się urodzisz i kiedy, społeczeństwo będzie od Ciebie oczekiwało czegoś innego. Chciałabym żebyśmy patrzyły na to trzeźwo i oddzielały to co jest społecznymi oczekiwaniami i spowodowanymi nimi systemowymi problemami od tego co indywidualne jednostki robią w sferze wyrażania siebie. Bo to są dwie różne kwestie. Czasami wystarczy trochę dobrej woli i otwartego serduszka żeby się zorientować we własnych przywilejach i jak przeskoczyć dyskomfort kiedy sobie o nich uświadamiamy :-) 🖤",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17892448414288122,
        "created_at": 1547837492,
        "text": "@pauljnna 2.0, bądź człowiekiem 2.0. I o tym jest ta kampania. Nie o tym jakim masz być mężczyzną, tylko o tym żebyś nie był ekhym dupkiem. I tyle.",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17959294384220741,
        "created_at": 1547837401,
        "text": "@tomekwawrzyniuk Nowy twór? Mężczyzna 2.0? Reklama pokazuje ludzi którzy są dla siebie mili, dobrzy, którzy stają w swojej obronie, pomagają sobie wzajemnie i rozumieją jak być lepszym człowiekiem, przeciwko tej właśnie toksycznej męskości o którą ten hałas, która jest wszędzie reprezentowana. I to wywołuje w Tobie złość? Że ktoś mówi - Mamy problem z tym jak mężczyźni są wychowywani w naszej kulturze, jakie wzorce im pokazujemy - bądźmy lepsi, męskość to nie monolit, to jest społeczne wyobrażenie tego co za nią uważamy, więc odwrocmy się od tej jednowymiarowej reprezentacji, w którą jesteśmy zmuszani i oczekujmy więcej od siebie. To jest logiczne dla mnie, że skoro ogromna większość przemocy statystycznie (wliczając w to wszystko od pobić do zabojstw) jest powodowana przez mężczyzn, musimy przedefiniować to w jaki sposób rozumiemy męskość i jak to przekazujemy w kulturze. Jak mężczyźni powinni się traktować I traktować innych. Dalej mi tu zalatuje \"notallmen\". Odwracanie uwagi od dyskusji w jaki sposób być lepszym. Skoro już jesteś lepszy, to nie powinno Cię to bulwersowac, bądź przykładem. Nie rozumiem tej wzmianki o zamieniamy kobiet na mężczyzn? Zupełnie nie wiem skąd się to wzięło w Twojej wypowiedzi, bo to wskazuje na biologiczny determinizm, któremu się bardzo sprzeciwiam, nie ma to nic wspólnego z tym o czym rozmawiamy. Nikt Ci nie mówi, że masz być facetem 2",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17931985261251526,
        "created_at": 1547836083,
        "text": "Boże @pauljnna, jak mi jest super miło czytać takie komentarze, które uzwględniają perspektywę mężczyzny. Bo przecież to głównie ich/ nas, choć nie tylko wiadomo, ta cała akcja dotyczy. Zgadzam się z Tobą w większości, ale ja czuję się zawiedziony tą kampanią, ale trochę z innego powodu niż te, o których mówicie. Nie oburza mnie w niej agresja, ani kreacja - sposób w jaki stara się pokazać te problemy. Wręcz przeciwnie, pierwszy raz, kiedy @cialkiem_cudownie mi ją wysłała poczułem na maxa poruszenie, aż do momentu ostatnich klatek i przeczytania info od autorów/ wytłumaczenia tej kampanii. Poczułem wtedy ogromną złość, która wynikała z uświadomienia sobie, że my nie próbujemy pokazac mężczyzny, tylko tworzymy nowy twór. Totalnie nie rozumiem po co. Miałem od razu takie skojarzenie do popularnej tezy z lat 70/80-tych, która mówiła że jest więcej gejów, bo oni się tworzą, bo mamy „takie czasy” i argumentem było m.in.  to, że orientacja zależy od pierwszego kontaktu seksualnego. Przecież to była bzdura, zawsze ich było tyle samo. Tylko nasza świadomość się zwiększa. Nie rozumiem dlatego, po co my próbujemy tworzyć upgrade mężczyzny? Będzie mężczyzna 2.0? A za 50 lat przemodulujemy płeć i kobieta będzie mężczyzną, a mężczyzna kobietą? 😞 Boli mnie to, że próbujemy tak to wszystko racjonalizować, argumentować to zmianą czasów. (patrz np.: klatka z newsami z różnych telewizji). Przecież zawsze było tak samo, jesteśmy tymi samymi mężczyznami i kobietami - jedyne co się zmieniło to to, że zwiększyła się nasza świadomość. Świadomość ludzi wokół nas, emocji i ich przeżywania. Teraz 6-letnie dziecko potrafi odpowiedzieć na pytanie: - kim chcesz zostać? - szczęśliwym człowiekiem. Czy to oznacza, że mamy tworzyć dziecko 2.0? \nPoza tym mam wrażenie, że kampania porusza za dużo wątków. To się rozmywa, każdy się skupia na nieistotnych szczegółach. Ta kampania po prostu jest źle zrobiona. Chciałbym bardzo zobaczyć ich brief jaki dostali do pracy, a następnie etapy tworzenia copy i kreacji. Jestem przekonany, że mieli bardzo dobre intencje i szacunek im za to. Przynajmniej bardzo w to wierzę.",
        "owner": {
            "id": "3301573542",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/3ad00b7670ddacda04e86f9e4596fa4b/5D50859E/t51.2885-19/s150x150/50562190_377532029715591_5007007023238217728_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "tomekwawrzyniuk"
        },
        "answers": []
    },
    {
        "id": 18007692976097383,
        "created_at": 1547821245,
        "text": "@pauljnna bardzo się cieszę👌to dobry znak!",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17991973435159018,
        "created_at": 1547821207,
        "text": "@pauljnna Dziękuję za ten komentarz, bardzo mądry głos ❤️",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17892568804293477,
        "created_at": 1547816440,
        "text": "A i jeszcze żeby nie było że się \"bezpodstawnie\" wypowiadam. Rozmawiałam o tej kampanii z około 20 cisfacetami tutaj w Danii i wszyscy murem odpowiedzieli że miło jest to widzieć i że się cieszą na takie podjęcie tematu. Jak ich zapytałam czy jest z tą kampanią coś nie tak dużo odpowiedzi było - \"gdyby to nie było robione dla kasy\", więc raczej problem z tym czy Gillette rzeczywiście chce walczyć o równouprawnienieczy robi to dla dolarów bo teraz modnie. I większość z nich powiedziała mi że chcieliby wierzyć że oni to \"Ci dobrzy\" w tym filmie, i że ich to motywuje. Także z takimi reakcjami się spotkałam od bliskich mi mężczyzn :-)",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17849725534335300,
        "created_at": 1547814631,
        "text": "Smutne jest jak dużo czasu i emocjonalnej pracy oczekuje się od mniejszości doświadczających opresji kiedy nagłaśnia się problem, który zmienia status quo. Ten argument pachnie \"notallmen\" i \"alllivesmatter\" - odwracaniem dyskursu w sposób który nie jest produktywny, od rozmowy o systemowej opresji i toksycznej męskości, dlatego że sprawia że biali/mezczyzni/heteronormatywni czują się w niej niekomfortowo. Nie dziwi mnie to w ogóle - his(her)storia pokazuje, że grupy walczące o równouprawnienie (od zwalczania segregacji po sufrazystki) zawsze spotykaja się z tzw \" tone policing\". Nikt w tej reklamie nie powiedział \"wszyscy\" - wręcz przeciwnie. Czemu Ci mężczyźni nie skupia się w tej reklamie na tych pozytywnych reprezentacjach, czemu ich nie chcą oswoić? Ta reklama jest o redefiniowaniu pojęcia męskości jako jednowymiarowej i szkodliwej. Czasami warto zastanowić się dlaczego coś nas uwiera, i czy może to przyczynie \"ale ja nie, ja jestem inny\" nie jest aby wynikiem uprzywilejowania. Warto zmierzyć się z tym co jest niewygodne.",
        "owner": {
            "id": "550220606",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/a318b0b65f3d52978cf3d9c056d2e4b8/5D3460C7/t51.2885-19/s150x150/47471091_326851081488834_5375183001514672128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "pauljnna"
        },
        "answers": []
    },
    {
        "id": 17868501088305560,
        "created_at": 1547802427,
        "text": "@lewogram a znajomi mogą być w szoku, że to mogło kogoś poruszyć, bo wszędzie jest szydera że jak kogoś to poruszyło to znaczy ze ten ktoś ma problem ze sobą 🤦‍♀️ jak dla mnie to to jest absurd",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 18008453869099267,
        "created_at": 1547802357,
        "text": "@lewogram jasne że nie mówił. Ale to tak samo jak nikt nie mówi w reklamach podpasek „wasz okres jest czymś czego powinnyście się wstydzić” :) Ja tylko daję światło z innej strony jak to odebraliśmy.",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17979682789198831,
        "created_at": 1547802248,
        "text": "@cialkiem_cudownie i nikt nie mówił w tej reklamie \"wszyscy jesteście tacy sami\"",
        "owner": {
            "id": "998179766",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f290c47530e6024a8171a37d196b628e/5D29804E/t51.2885-19/s150x150/52341751_1943657922427452_597217165308854272_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lewogram"
        },
        "answers": []
    },
    {
        "id": 17990194954165315,
        "created_at": 1547802207,
        "text": "@kayaszu moi znajomi też są w ogóle w szoku, że to mogło kogoś poruszyć",
        "owner": {
            "id": "998179766",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f290c47530e6024a8171a37d196b628e/5D29804E/t51.2885-19/s150x150/52341751_1943657922427452_597217165308854272_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lewogram"
        },
        "answers": []
    },
    {
        "id": 17993268316178251,
        "created_at": 1547786773,
        "text": "😄☺",
        "owner": {
            "id": "1702350026",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/e048014c3ccdd0523871502cedfc8cb6/5D2B0E00/t51.2885-19/s150x150/47586477_2213651665544377_9162056379362443264_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "xayiyax"
        },
        "answers": []
    },
    {
        "id": 17992983442146113,
        "created_at": 1547784807,
        "text": "Jesli chcesz dotrzec do jeszcze wiekszej ilosci osob, dolacz do teamu #rocketlike ❣️ info w moim bio",
        "owner": {
            "id": "1324192605",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/b807e23ceb7e05d4f61ce29143efc4bc/5D3B480C/t51.2885-19/s150x150/49791090_772251393110342_7925040570446118912_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "miraabell"
        },
        "answers": []
    },
    {
        "id": 17993764423182885,
        "created_at": 1547776271,
        "text": "😎👌",
        "owner": {
            "id": "5952818424",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/11b5048f6d118e5310d31230d2a63769/5D31C127/t51.2885-19/s150x150/40213496_1933311150025204_7469943898731708416_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "damiannojek"
        },
        "answers": []
    },
    {
        "id": 17959419631217591,
        "created_at": 1547774892,
        "text": ":-)\nSuperancko ;]",
        "owner": {
            "id": "9496474153",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/c70bb4989cc91fcc98eacb1e7c951782/5D2FFA76/t51.2885-19/s150x150/49485932_2040199742741114_4270722076765061120_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "marinkadiv"
        },
        "answers": []
    },
    {
        "id": 18007732990098092,
        "created_at": 1547774779,
        "text": "@kayaszu no to tylko się cieszyć :) Ja tylko chciałam zrobić kontrę dla retoryki agresji/siły/presji i zaproponować alternatywę.",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17993480611176697,
        "created_at": 1547773560,
        "text": "A ja spytałam i moi znajomi nie mają z nią problemu.",
        "owner": {
            "id": "1530622911",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/0272c6798877f6c76343655ff0ebc3a3/5D41DAC0/t51.2885-19/s150x150/47692376_353519362113145_5663515048132214784_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "kayaszu"
        },
        "answers": []
    },
    {
        "id": 17999800495140641,
        "created_at": 1547771824,
        "text": "@_annie_bellee No to skoro nie wiesz, to może ich zapytaj? Z wieloma mężczyznami tak rzadko się rozmawia o tym, co czują.",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    },
    {
        "id": 17962773724200456,
        "created_at": 1547771527,
        "text": "Yyyy🤦‍♀️ a ja nie czaje co w tej reklamie ich tak boli? Serio te reakcje sa tak zalosne xD",
        "owner": {
            "id": "3017919812",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/0ae286231825f247925b93f0407490ca/5D3B1E67/t51.2885-19/s150x150/47029500_380722796008203_7026358220406915072_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "_annie_bellee"
        },
        "answers": []
    },
    {
        "id": 17979475420198611,
        "created_at": 1547770540,
        "text": "#reklamagillette #gillette #gillettead #prawamezczyzn #polskimężczyzna #oczamimezczyzny #polskichlopak #polskichłopak #feminizm #feministycznapropaganda #rownosc #mezczyzna #opinie",
        "owner": {
            "id": "9175421333",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/38d0a06a7b94f83ca3b79c82df24619a/5D454319/t51.2885-19/s150x150/44586830_523775288145014_2674082462811815936_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "cialkiem_cudownie"
        },
        "answers": []
    }
]