[
    {
        "id": 18009541837114154,
        "created_at": 1548227528,
        "text": "@mental_health_for_men I agree",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 18025408951001078,
        "created_at": 1548200341,
        "text": "@lilnoosh I just think the conversation should be had in a way that isn’t offensive. How Gillette was framing the situation was that men being despicable and controlled by toxic masculinity is the norm, and telling all men that they need to be better than they are. (I’m not saying there aren’t lots of men out there that need to change though)\nBut if the ad was made framing all women as despicable misandrist femenazis, and saying women being despicable and ignoring the views of men is the norm, and that the majority of women need to change and be better people, there would be a large outcry of sexism.\nAnd personally I feel this is a good framework to bare in mind when crafting something aimed specifically at those of another gender with the intent of correcting or changing the behaviour of that gender — if it is not a good method of addressing one gender, it will not be a good method of addressing another.",
        "owner": {
            "id": "9914711634",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/b90c123bfe428f5467da2f460c00fab2/5D2D5602/t51.2885-19/s150x150/47585501_393732218033368_934647525707612160_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "mental_health_for_men"
        },
        "answers": []
    },
    {
        "id": 17948682832238238,
        "created_at": 1547825648,
        "text": "You’re a sad, pathetic little attention seeker. You are exactly the type of guy Gillette was talking about. Do better, kid.",
        "owner": {
            "id": "1422563083",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/256ea6a16198da12d146562677ad1fcc/5D2BC67C/t51.2885-19/s150x150/26155922_1925498574130272_6086252027489288192_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "dmontjar"
        },
        "answers": []
    },
    {
        "id": 17997230515184381,
        "created_at": 1547769263,
        "text": "@leanneyhunter totally! I guess I just have this fear that by boycotting (this corporate company- don’t get me wrong at the end of the day it’s an ad to sell razors) we are taking a step back in the conversation of making progress towards boys becoming more empowered to be soft and feel their feelings and uplift one another instead of belittle or hurt or feel unbalanced in the type masculinity that may be unhealthy.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 18023957329037411,
        "created_at": 1547768738,
        "text": "@lilnoosh I think the advert may be interpreted differently by different people. We have some opposing views in the fact that you feel it’s positive but we feel it’s negative. We can respectfully agree to disagree and that is okay 💕",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 17980164682195943,
        "created_at": 1547768550,
        "text": "@leanneyhunter that’s beautiful that he can be healthy in that! That’s so incredibly rare and I hope more and more men can work towards what your fiancée has. Sounds amazing - best wishes to you both.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17996423248193889,
        "created_at": 1547768472,
        "text": "@leanneyhunter I see that. I also totally appreciate the respectful conversation too! As a daughter, sister, girlfriend, and aunt, I feel like it presented the difference between what healthy masculinity looks like and what toxic masculinity looks like. If men are healthy in their masculinity, then the ad wasn’t about them. I don’t think being held accountable to self improvement and community engagement is an attack or belittling but a call to arms.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17996497321191886,
        "created_at": 1547767755,
        "text": "@leanneyhunter that’s great I agree with you, masculinity in a guy is attractive!",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17868210988307203,
        "created_at": 1547767695,
        "text": "@masculineactivism I agree, there is nothing wrong with showing masculinity in the way you want to. I applaud the masculinity in my fiancé, this is what first attracted me to him 22 years ago. He is my protector and that’s not because I pressure him to fit this toxic masculinity rubbish or because he feels pressure from society etc. It is because he is an individual who embraces his masculinity and is full of testosterone, he uses it in a good way and the way he wishes too. This advert suggests that is a bad thing.",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 18000255823082284,
        "created_at": 1547767568,
        "text": "@lilnoosh I agree, men’s feelings are very important!",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17853975412322739,
        "created_at": 1547767510,
        "text": "@masculineactivism I don’t think choosing a kinder route disadvantages those who choose to fight our wars. Being responsive in a shooting does not necessarily mean you have to be tough. I think where we are differing is that “tough” means. I think being told to toughen up has become an easy way to disregard a man’s feelings, which are so so important and often not taken seriously. That’s what starts shootings in the first place. Suppression of an emotional life that leads to acts to gain control of something.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17847438310339920,
        "created_at": 1547767398,
        "text": "@lilnoosh You know I genuinely appreciate a civilised debate and I totally respect your views on this, I can also understand why you feel how you do. There are many areas where the three of us agree, just in different ways.\nHowever my overall opinion is that there may be a good message at the bottoms of it but it has been tackled in the wrong way and has alienated many men as a result. As the mother of a son, the daughter of a father, the sister of a brother and the fiancé of yet another very good man, I feel let down, hurt and insulted by the picture this paints of men in general.",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 17948919628226049,
        "created_at": 1547767280,
        "text": "@masculineactivism I see what you mean about it feeling belittling. I’m curious about that as I think many have become of red alert now based off of any sort of critique. But where did they say to stop being rapists though? That’s what I’m confused about. They were asking to stand up when you can for the people around you. Complementing is also a positive way but I think that also brings us to a place where critique is not welcomed and it feels like an attack, when really it is just looking at what issues are there and how we can get better. That’s a huge part of being empowered. When at work, we get reviews of what we did well and what we can improve on right? I think that’s crucial and constructive and positive.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17850292018334056,
        "created_at": 1547766852,
        "text": "@lilnoosh I agree but boys shouldn’t be discouraged to tougher up either because then who is going to fight the wars or stop a shooting. Masculine or feminine traits in a man are great, I just don’t appreciate a company trying to lecture me about how to be a man. It’s condescending. I have my own definition of a man that I live by.",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17958779011216834,
        "created_at": 1547766649,
        "text": "@leanneyhunter I found the story of the ad to be positive. It pointed out issues that are real and then provided a positive solution of love and kindness. I agree. The ad shows many issues that men face. And then what we can do in small ways as leaders that young boys look up to. It’s providing how powerful having softness and compassion can be and that those things are not just for women but for all of us. It’s trying to end the stigma that being kind and soft is being weak. That’s not fair to our boys who are often told to “toughen up”.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17948676229239221,
        "created_at": 1547766521,
        "text": "@lilnoosh I don’t agree that it’s empowering, I’ve already stated previously what I think empowering is. Empowering is complementing men. Empowering is the posts I make. Telling men they need to stop being rapists isn’t very empowering to me. Telling me they can’t get into small fights every now and then isn’t empowering. Appreciating men for all the hard work they do for their families and for themselves is empowering",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17999982271087693,
        "created_at": 1547766344,
        "text": "@masculineactivism I hear that. But I do not believe it is belittling. A defense reaction comes from a place of feeling accused. It is an opportunity to encourage men to step into those scary, shaky parts that they are not allowed to talk about. It’s empowering because it shows the challenges many face and a positive solution to lift each other up. It’s all about lifting up one another in times of hardship. They needed to display the hardship in the beginning to provide a solution.",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 18000068671094543,
        "created_at": 1547765988,
        "text": "@leanneyhunter thank you, I believe everyone should feel empowered and have positive vibes spread their war, I agree with your message!",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 18023764813041035,
        "created_at": 1547765841,
        "text": "@lilnoosh also (just pasting what I wrote earlier) I feel it’s disempowering men because I’m sick of them being made out to be pigs who control society and women being made out to be held back and less powerful and stuff.\n\nThe most powerful people/leaders in the Uk are women - the Prime Minister, the Queen etc.\nWe’re not in a 3rd world country, neither is the USA. We don’t need this harmful stigma against our men and boys.\nThey are literally the most disadvantaged group of people I know of in our society. They have a really bad deal in the developed world, and this just adds to that problem.",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 17905940329284128,
        "created_at": 1547765578,
        "text": "@lilnoosh it’s not empowering because it is condescending. They are sitting me down belittling me like I’m a five year old and telling me what I can and cannot do, how I should and should not think. It’s not a company’s job to do this, it’s their job to make razors. If you want to empower men, thank all the men in the military and law enforcement for risking their lives everyday for you. If you want to empower them, support them whether they act masculine or feminine. If you want to support them, stop assuming that they are inherently sexist/assault people. If you want to empower men, tell them that their feelings are valid. If you want to empower men, don’t belittle them and try to teach them a lesson. Don’t sit men down and teach them not to rape, because inherently they think that you think that they are automatically rapists and bad people. Men deserve positivity, not stigma!",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 18015963601073256,
        "created_at": 1547765578,
        "text": "@lilnoosh it painted them in a bad light. That’s why I feel let down by it for the men in my life.",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 18013883014078300,
        "created_at": 1547764278,
        "text": "@leanneyhunter I think the ad was empowering men because all of these reasons you stated! And the suicide rate in men are the highest in the world. How was the ad not empowering men?",
        "owner": {
            "id": "10323020",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/baf39258e0e130c468bf461a57c4a265/5D3A92FD/t51.2885-19/s150x150/45376946_284762529047552_138044084299235328_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "lilnoosh"
        },
        "answers": []
    },
    {
        "id": 17843905876347489,
        "created_at": 1547661986,
        "text": "@rad_thadd More than 90% of rape is commited by men. More than 95% of pediphilia rape are commited by rape. More than 90% men are raped by other men. The evidence is easy to find. Literally just google \"rape\". But I see you want to live in the dark and there's nothing I can do about it. I am not your fucking teacher, learn something on your own",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17901977812285953,
        "created_at": 1547645529,
        "text": "@rad_thadd Listen male, if you rather want to chat in German or French I will be happy to do so. Besides, the burden of proof rests on the one making the claim. Everything you said was fake news and a lie so stfu or lear how to talk.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 18021612427051936,
        "created_at": 1547645202,
        "text": "@rad_thadd There are more MEN PEDOPHILES, there are more MEN RAPISTS, more men abandoning their children, more FAT MEN and most people who commit VIOLENT CRIMES are MEN. #facts",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17902099390285264,
        "created_at": 1547644287,
        "text": "@rad_thadd I stated FACTS, sorry if that offends you. Facts don't care about your feelings.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17992565281151971,
        "created_at": 1547644238,
        "text": "@rad_thadd Get laid man, you're acting crazy. I know no woman wants you but there are prostitutes, you know.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17947765105237436,
        "created_at": 1547644122,
        "text": "@rad_thadd Namecalling? I guess when I gave you a bunch of facts and you resort to that, we know who won. #feminism",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 18023037826005581,
        "created_at": 1547643364,
        "text": "@rad_thadd Well, you now you know you should do that. Why don't you? Is it for some reason imposibble for you to go OUTSIDE and use internet for RESEARCH. A day has 24 hours, you know. So, to conclude, men are more overweight, more often pedophiles, more often rapists, don't value education as much as women and abandon their children more and everything you said was wrong even though you have acces to the internet. That part was amazing. Have a nice day.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17906541628280105,
        "created_at": 1547642683,
        "text": "@rad_thadd To compare nazis who killed millions of people to people who fight to have basic human rights and socal equality. Wow. A special kind of s...",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17999274379093540,
        "created_at": 1547642627,
        "text": "@rad_thadd FALSE. Just like your previous comments. Do you even know how to write a fact or something that is true? Stop spending so much time on the internet and go outside, into the real world.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17992531012151614,
        "created_at": 1547641801,
        "text": "@rad_thadd Maybe if you used internet to look for facts and data to learn something instead of getting your information on social networks, you would know something.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 18022287901050496,
        "created_at": 1547641732,
        "text": "@rad_thadd MEN are more OVERWEIGHT.  MEN- 73.6 women-66.9",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 18007538167110497,
        "created_at": 1547641648,
        "text": "@rad_thadd MEN rape more CHILDREN. Most PEDOPHILES are MEN. Men RAPE more. They ABANDON their children and leave them without a father. Women are genetically designed to put on weight more. Did you skip a biology class?",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17995073401185917,
        "created_at": 1547639198,
        "text": "@masculineactivism No. Source for that statistic please? (Also, most violent crimes are committed by men.)",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17931208309249709,
        "created_at": 1547638929,
        "text": "@little_book_diary 50 % of domestic violence happens to men and there are no shelters for them",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17867545759307441,
        "created_at": 1547630184,
        "text": "@leanneyhunter Males make worse life decisions. They eat unhealthier on average, value education less etc. You can't force someone to care about themselves. They should take better care of themselves tbh. Shelters are for women because most victims are women, so it makes sense. Those are facts. Just how there is more fight against obesity than anorexia. One is nt more important than the other, but it is more common.",
        "owner": {
            "id": "6952176423",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/82182dfc0cb8dc6d1bb64a6110c98690/5D33FDCB/t51.2885-19/s150x150/28434182_408868426203626_212131518535958528_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "little_book_diary"
        },
        "answers": []
    },
    {
        "id": 17948762914238686,
        "created_at": 1547602599,
        "text": "@rad_thadd yes I do",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 17991366868157158,
        "created_at": 1547602583,
        "text": "ugh you use gilette?? in 2019?????? grow up",
        "owner": {
            "id": "10179016039",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/191ea1cf21a4a8025174e00298db2943/5D2A46E6/t51.2885-19/s150x150/54732055_536478816759502_8512052004401446912_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "transmed.dad"
        },
        "answers": []
    },
    {
        "id": 18022490053046308,
        "created_at": 1547602580,
        "text": "@leanneyhunter agreed, thank you 🙏🏿",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    },
    {
        "id": 18020881552031209,
        "created_at": 1547602569,
        "text": "i have no odes what the context behind this photo is but its making me laugh so hard and i dont know why",
        "owner": {
            "id": "10179016039",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/191ea1cf21a4a8025174e00298db2943/5D2A46E6/t51.2885-19/s150x150/54732055_536478816759502_8512052004401446912_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "transmed.dad"
        },
        "answers": []
    },
    {
        "id": 17959047748213059,
        "created_at": 1547601430,
        "text": "That video annoys the hell out of me.\nMen are let down in all ways. They need support, not stigma. 👤 The majority of suicide victims are male.\n👤 There are many more men sleeping rough on the streets than women.\n👤 The prison population is mostly male.\n👤 Men are much more likely to have dropped out of school and have no qualifications compared to women.\n👤 You never hear of an all male shortlist when a company recruits.\n👤 Females are protected against genital mutilation, nobody cares when boys are circumcised without consent and for absolutely no medical reason.\n👤 Nearly all domestic violence shelters are for women.\n👤 If a woman leaves the family home with her child, she is escaping. If a man takes his own child he is kidnapping them.\n👤 Only women can be raped according to our law.\n\nI could go on for hours. We need equality for all, not feminism and all that rubbish. This has got to stop. #boycottgillette and stand by our men.",
        "owner": {
            "id": "5840366675",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/19724dbfa8ad02921987d48e4cdf4cfb/5D3A3FC3/t51.2885-19/s150x150/52708803_3119605374731511_8980606122914217984_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "leanneyhunter"
        },
        "answers": []
    },
    {
        "id": 17992058713151546,
        "created_at": 1547599555,
        "text": "@rad_thadd ik",
        "owner": {
            "id": "8387972440",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/d0cbf165475c3f53abab9a8f93c71b40/5D3A2E26/t51.2885-19/s150x150/47582306_656410911428514_3616240782513537024_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "actualmeninist"
        },
        "answers": []
    },
    {
        "id": 17904939826303803,
        "created_at": 1547599069,
        "text": "@rad_thadd ｂｉｇ　ｇａｙ",
        "owner": {
            "id": "8387972440",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/d0cbf165475c3f53abab9a8f93c71b40/5D3A2E26/t51.2885-19/s150x150/47582306_656410911428514_3616240782513537024_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "actualmeninist"
        },
        "answers": []
    },
    {
        "id": 18022134616046029,
        "created_at": 1547584250,
        "text": "🔥🔥🔥",
        "owner": {
            "id": "2159034834",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/503f32b62e3be99064c8aed7589ca362/5D500071/t51.2885-19/s150x150/51139355_406358470171830_1030020749143834624_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "mrperfectau"
        },
        "answers": []
    },
    {
        "id": 17985064849174279,
        "created_at": 1547583058,
        "text": "#mensrights #mensissues #maleactivist #malepositivity #malebodypositivity #bodypositivity #mgtow #equality #sexism #misandry #masculinity #genderroles #gay #conservative #gayconservative #mensrightsmovement #mra #himtoo #meninist #politics #man #men #boy #feminist #equalrights #malevictims #boyappreciation",
        "owner": {
            "id": "9524684336",
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f26dc4d97c072ae367b3ee3f6bc6c995/5D500895/t51.2885-19/s150x150/46661576_198035491144392_4849292761817415680_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "masculineactivism"
        },
        "answers": []
    }
]