[
    {
        "id": 17998596898179283,
        "created_at": 1549057749,
        "text": "@fabianamotroni thanks bro rip grampy",
        "owner": {
            "id": "2957997064",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f05c7f50fb449b454394d4d47f76f375/5D2E9E66/t51.2885-19/s150x150/33124968_1673371816078416_4543055554888597504_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "averykeller14"
        },
        "answers": []
    },
    {
        "id": 17990821819175269,
        "created_at": 1549056229,
        "text": "@averykeller14 I had the consideration to answer you back, and you brought me this condescending 'please grow up´, that only validates even more my arguments and all the fight against toxic gender stereotypes and behaviour. The same applies for the ´don´t respond this´. You are no entitled to finish a conversation as you wish, like if you just pick up the ball and left the game and your fellow players without the ball and the right to go on with the game. It´s unbeliveable sad how you keep doing, unshamely, the same thing we are criticizing, bottom line. And cancer is what killed my grandpa. The fight against any toxic behavour that hurts humanity and delay it´s path to balance and a fair life for everyone is called fight for civilization, not disease. Have a good life.",
        "owner": {
            "id": "222682586",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/8fa209872d8e4afd7f0e7ffe245c553d/5D3BAEF1/t51.2885-19/s150x150/30982197_479506319134752_9061515803462991872_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "fabianamotroni"
        },
        "answers": []
    },
    {
        "id": 17852639581340056,
        "created_at": 1549051068,
        "text": "@fabianamotroni Im not even going to respond factually to this. This is pure cancer and I’m sorry you think like this. Please grow up and doesn’t respond to this",
        "owner": {
            "id": "2957997064",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f05c7f50fb449b454394d4d47f76f375/5D2E9E66/t51.2885-19/s150x150/33124968_1673371816078416_4543055554888597504_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "averykeller14"
        },
        "answers": []
    },
    {
        "id": 18027695833025480,
        "created_at": 1548890131,
        "text": "@averykeller14 it's not the ad that is sexist, on contrary, its reveals and brings vibility to sexism since masculinity, when used to exclude and/or hurt others that not belongs to the same gender and/or not perform as exoected to its gender, this masculinity itself is sexism. It seems that your aproach does not consider that masculinity, toxic or healthy, is strucutural in our society, so, yes, it's totally logic and without prejudice to portrait men, in general, as social group, and as group of hegemony in power, as performers of toxic masculinity, even if, in an individual basis, there is a spectrum of this performance, from 0,1 to 100%. This the meaning of the #NotAllMen concept-critical, that when some man does not acknowledge that there's a structural misogyny and sexism (against the non-male, as women, gay, etc) in society, saying 'but not all men performs/act like that' as if it was about one or himself, these men are in denial. What's is sad and just delay the fight against the sexist ad mysoginous behaviours we are calling men to fight with us.",
        "owner": {
            "id": "222682586",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/8fa209872d8e4afd7f0e7ffe245c553d/5D3BAEF1/t51.2885-19/s150x150/30982197_479506319134752_9061515803462991872_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "fabianamotroni"
        },
        "answers": []
    },
    {
        "id": 17998621912134011,
        "created_at": 1548476075,
        "text": "Se quiser saber como melhorar a comunicação do seu negócio. É só falar!😀...",
        "owner": {
            "id": "4034234077",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/bd7356cb327dec182a718ca75c30e9b2/5D3EF199/t51.2885-19/s150x150/24126495_130725320946098_4459127882425303040_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "conexodesign"
        },
        "answers": []
    },
    {
        "id": 17893588291291280,
        "created_at": 1548135386,
        "text": "This ad is sexist. If you can’t see that you don’t know what sexism is. Taking the negative behavior of a small number of people and then holding a much much larger group collectively accountable simply because they share a gender with the people is sexist. It’s not about being offended or not. It’s about calling it out for what it is. What is wrong with you how can you not see this. If gillete made an ad asking black people to stop mugging each other would you be saying I don’t get it they are asking black people to be decent human being?",
        "owner": {
            "id": "2957997064",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f05c7f50fb449b454394d4d47f76f375/5D2E9E66/t51.2885-19/s150x150/33124968_1673371816078416_4543055554888597504_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "averykeller14"
        },
        "answers": []
    }
]