[
    {
        "id": 17866202965334751,
        "created_at": 1551726319,
        "text": "😃😃✌!!",
        "owner": {
            "id": "8371691282",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/3b5735251b2a1ba857eb15582ebb5d79/5D34630A/t51.2885-19/s150x150/42840713_2238473583095339_6001950134525493248_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "djoldtime"
        },
        "answers": []
    },
    {
        "id": 18001432144093658,
        "created_at": 1548161966,
        "text": "@polarityexpert I believe they are conditoned to accept and enable the behaviour. Right from day one we see on media that we are sex objects. Our parents are constantly talking about our looks. We are judged on our attractiveness. And then we see on t.v. such movies like American pie etc.... Where it is humorized and looks to be accepted. Plus how easy do you think it is for a young girl to stick up for herself. Most young girls are to timid and vulnerable or even worse they've already been sexually assaulted and already have that feeling that their bodies are not their own. A lot of women don't say no out of fear it will only be worse... If I don't give in. Or if I give in I'll be loved. There is many reasons. But the sad truth is it goes both ways boys see this too and they think it's cool and accepted so they do it. Hey I think your onto something for sure. Men just want to be needed and appreciated for it. Women just want to be safe. Some people call me a feminist but I think the worst thing women did was femisnm as instead of us trying to gain respect for what we are. What are strength are we tried to prove we were the same as men. We are equal and opposite counter parts. So we need you guys to be men. And you need us to be women. At this point I don't even know what that means anymore lol. But I think maybe what also happened was by women trying to be men we exposed ourselves to being treated like men treat other men. Hopefully we can all find a balance one day :)",
        "owner": {
            "id": "2328858910",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/6ac32dc685ade0f1ceb2faffc3ad7a34/5D41EBD5/t51.2885-19/s150x150/21576521_117744275597934_7398427865710067712_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "miss.sarah.demi"
        },
        "answers": []
    },
    {
        "id": 17851814302329928,
        "created_at": 1548159339,
        "text": "exactly we need movements like these to remove toxicity among males.Society is in desperate need for boundary reset.as good men want to feel their efforts make a difference and women want to feel safe living in this society.The basics of masculinity and femininity satirically demonstrates 10 toxic masculine traits and provides guidance on how to be a better man! At the same time it allows women to understand how they are allowing and in some cases re-enforcing such behavior! #pusillanimous #polarityexpert #masculinityfeminity",
        "owner": {
            "id": "5717710472",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/3d429916f4d4771ee741832abdd28e60/5D317822/t51.2885-19/s150x150/22582456_281515332336994_5707175044258463744_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "polarityexpert"
        },
        "answers": []
    }
]