[
    {
        "id": 18024495112048754,
        "created_at": 1547706294,
        "text": "@guidom word my brother! Appreciate the well thought out reply - u know this message specifically resonates with me after that all nighter last year! 😂hope all is well in ur world g!",
        "owner": {
            "id": "868667088",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/024cef92953d8325742303cb481fb6d1/5D2A4634/t51.2885-19/s150x150/20583211_1702050016756656_1925896101831901184_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "nathanlarue"
        },
        "answers": []
    },
    {
        "id": 17980282987195164,
        "created_at": 1547682417,
        "text": "I was avoiding the story and viewing the commercial until I had a minute to really see what was going on. I just watched it..and will read some of the editorial pieces later....but after watching the commercial—I think its GREAT and see no problem with it. In fact, I felt it was a bit inspiring. (Yes-from a razor commercial). I dont care if it was “selling” dogfood, soda, water or any product. Conscious minds, like minded people choose to make it & to use the platform to say something impactful & positive. Whats wrong with that??🤔 That’s better than spreading fear, stupidity, or hate right? (Negativity) \nSearching for the article I noticed in one of the editorials one person said they were throwing their Gillette razor in the trash because of this. 🤔🤣🤣🤣\nI usually, as Nathan said dont respond too much on certain topics...because I dont have time for a game of social media pong and have other stuff to use my energy on...& also i dont trust or believe many people that oppose things are even real. (bots, algorithms, & certain official agencies that work to divide all of us-lol)....but I did want to on this topic because what wrong with advancing the human race to be better than it was or was before.  Whats wrong with people becoming conscious of things that the previous generations did not or becoming more aware of. Evolvement is a never-ending process. Stagnation is Death.  At times i think in 200 years in the future—what will people think about our time & what crazy things we did or things that totally did not make sense. Or how we thought..things that were “normal” or good—were just plain ridiculous. Its always been that way. Even when we look back 50 years from today or 100 years. Im done. Loose thoughts. Nathan👊🏽 THE END.",
        "owner": {
            "id": "1734997",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/f28d139c204a4842ac9366100328d1fc/5D38131E/t51.2885-19/s150x150/21568983_1422951947760322_5837645215724208128_n.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "guidom"
        },
        "answers": []
    },
    {
        "id": 17981224816199390,
        "created_at": 1547622343,
        "text": "Hahaha! All I am saying is that in my opinion the marketing wasn’t a bold move. I think you know that I am all for personal growth, development and self improvement. You and I have had many in depth conversations about what I stand for. So when say “soft” I’m not attacking empathy, grace & love. Although thank you for trying to frame it that way. The truth is your generation is soft, but not because of grace, empathy and love. Those are all attributes that every man should embrace. It is soft because the people of the generation can’t hear opinions without being made to feel uncomfortable and immediately try to cling to a moral high ground, kind of like you just did. Great things come from being challenged, great things come from discomfort and strife. I too have a daughter and I will teach her to love and be empathetic. I will also teach her to be accountable to herself and do the right thing because it is the right thing to do. I will do my best to instill this, but shit, if it doesn’t work, I can always play this Gillette commercial for her!😜😂😂",
        "owner": {
            "id": "1729726599",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/216ea8c07c349091a1dbb4e46dbedb21/5D44AE36/t51.2885-19/11191580_850785558341245_584205420_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "danian_rios"
        },
        "answers": []
    },
    {
        "id": 17959205239211155,
        "created_at": 1547619680,
        "text": "@david_like_the_king - smh 🤦‍♂️",
        "owner": {
            "id": "868667088",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/024cef92953d8325742303cb481fb6d1/5D2A4634/t51.2885-19/s150x150/20583211_1702050016756656_1925896101831901184_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "nathanlarue"
        },
        "answers": []
    },
    {
        "id": 17998905754094740,
        "created_at": 1547619626,
        "text": "@danian_rios - if soft is perceived as “men accountable to men” & my advocacy for men having those “soft” conversations for personal growth, development, & self improvement in areas that are often “shamed” to speak about in small group like a #mensministry ...than yup, definitely soft! @terrycrews endorsement of that is pretty soft too. Legacy is much more than achievement, my son is the next “soft” generation. So I’m just trying to make sure he leads with empathy, grace, & love...u know by showing him the example the best I can. Bandwagon or bold, pandering or controversial...it’s a message that resonated with me & the fact people are so quick to cast shade on a good message/ad is disappointing. I won’t disagree that the timing & spear points to the #metoomovement but #thebestamancanbe is a good message & the ad did a good job conveying it...don’t be such a bully unc, that’s what the commercial was talking about! 🤦‍♂️",
        "owner": {
            "id": "868667088",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/024cef92953d8325742303cb481fb6d1/5D2A4634/t51.2885-19/s150x150/20583211_1702050016756656_1925896101831901184_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "nathanlarue"
        },
        "answers": []
    },
    {
        "id": 17957953030220541,
        "created_at": 1547618014,
        "text": "@danian_rios 😂☝️",
        "owner": {
            "id": "287001596",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/d0ce0ffcb3260a881c4248c422495dab/5D509C64/t51.2885-19/11276282_106699219663469_309259747_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "david_like_the_king"
        },
        "answers": []
    },
    {
        "id": 17991274501148351,
        "created_at": 1547617278,
        "text": "I agree that there is a huge disconnect. It seems  to be more generational as opposed to political in this case. To me it just seems like Gillette is trying to sell more razors to millennials by being topical and riding the coat tails of the #metoo movement. It seems a bit pandering to me, but that’s just my opinion. I have to agree that It’s smart marketing because it’s low hanging fruit and will appeal to the market they are going after. I disagree with it being bold, if anything it’s safe to error on the side of political correctness. I would say that bold was the move Nike made with Colin Kaepernick. They new that that was political and could be far more polarizing. Either way, I respect your opinion and understand how soft your generation is 😂😂😂. I’m kidding Nephew, I love you!😊",
        "owner": {
            "id": "1729726599",
            "is_verified": false,
            "profile_pic_url": "https://scontent-dus1-1.cdninstagram.com/vp/216ea8c07c349091a1dbb4e46dbedb21/5D44AE36/t51.2885-19/11191580_850785558341245_584205420_a.jpg?_nc_ht=scontent-dus1-1.cdninstagram.com",
            "username": "danian_rios"
        },
        "answers": []
    }
]